export const klimovDecryption = [
  {
    resultValue: "Человек - природа",
    decryption:
      "Представителей этих профессий объединяет одно очень важное качество — любовь к природе. Но любовь не созерцательная. Которой обладают практически все люди, считая природу наиболее благоприятной средой для отдыха, а деятельная связанная с познанием ее законов и применением их. Одно дело — любить животных и растения, играть с ними, радоваться им. И совсем другое — регулярно, день за днем ухаживать за ними, наблюдать, лечить, выгуливать, не считаясь с личным временем и планами. Специалист должен не просто все знать о живых организмах, но и прогнозировать возможные изменения в них и принимать меры. От человека требуется инициатива и самостоятельность в решении конкретных задач, заботливость, терпение и дальновидность. Человек, работающий в сфере «человек-природа», должен быть спокойным и уравновешенным.",
  },
  {
    resultValue: "Человек - техника",
    decryption:
      "Особенность технических объектов в том, что они, как правило, могут быть точно измерены по многим признакам. При их обработке, преобразовании, перемещении или оценке от работника требуется точность, определенность действий. Техника как предмет руда представляет широкие возможности для новаторства, выдумки, творчества, поэтому важное значение приобретает такое качество, как практическое мышление. Техническая фантазия, способность мысленно соединять и разъединять технические объекты и их части — важные условия для успеха в данной области.",
  },
  {
    resultValue: "Человек - человек",
    decryption:
      "Главное содержание труда в профессиях типа «человек-человек» сводится к взаимодействию между людьми. Если не наладится это взаимодействие, значит, не наладится и работа. Качества, необходимые для работы с людьми: устойчивое, хорошее настроение в процессе работы с людьми, потребность в общении, способность мысленно ставить себя на место другого человека, быстро понимать намерения, помыслы, настроение людей, умение разбираться в человеческих взаимоотношениях, хорошая память (умение держать в уме имена и особенности многих людей), терпение.",
  },
  {
    resultValue: "Человек - знаковая система",
    decryption:
      "Мы встречаемся со знаками значительно чаще, чем обычно представляем себе. Это цифры. Коды, условные знаки, естественные или искусственные языки, чертежи, таблицы формулы. В любом случае человек воспринимает знак как символ реального объекта или явления. Поэтому специалисту, который работает со знаками, важно уметь с одной стороны, абстрагироваться от реальных физических, химически, механических свойств предметов, а с другой —представлять и воспринимать характеристики реальных явлений или объектов, стоящих за знаками. Чтобы успешно работать в какой-нибудь профессии данного типа, необходимо уметь мысленно погружаться в мир, казалось бы, сухих обозначений и сосредотачиваться на сведениях, которые они несут в себе. Особые требования профессии этого типа предъявляют к вниманию.",
  },
  {
    resultValue: "Человек - искусство",
    decryption:
      "Важнейшие требования, которые предъявляют профессии, связанные с изобразительной, музыкальной, литературно-художественной, актерско-сценической деятельностью человека — наличие способности к искусствам, творческое воображение, образное мышление, талант, трудолюбие.",
  },
];

export const hollandDecryption = [
  {
    resultValue: "Реалистический",
    decryption:
      "Реалистическому типу личности свойственна эмоциональная стабильность, ориентация на настоящее. Представители данного типа занимаются конкретными объектами и их практическим использованием: вещами, инструментами, машинами. Отдают предпочтение занятиям требующим моторных навыков, ловкости, конкретности.",
  },
  {
    resultValue: "Интеллектуальный",
    decryption:
      "Интеллектуальный тип ориентирован на умственный труд. Он аналитичен, рационален, независим, оригинален. Преобладают теоретические и в некоторой степени эстетические ценности. Размышления о проблеме он предпочитает занятиям по реализации связанных с ней решений. Ему нравится решать задачи, требующие абстрактного мышления.",
  },
  {
    resultValue: "Социальный",
    decryption:
      "Социальный тип ставит перед собой такие цели и задачи, которые позволяют им установить тесный контакт с окружающей социальной средой. Обладает социальными умениями и нуждается в социальных контактах. Стремятся поучать, воспитывать. Гуманны. Способны приспособиться практически к любым условиям. Стараются держаться в стороне от интеллектуальных проблем. Они активны и решают проблемы, опираясь главным образом на эмоции, чувства и умение общаться.",
  },
  {
    resultValue: "Конвенциальный",
    decryption:
      "Конвенциональный тип отдает предпочтение четко структурированной деятельности. Из окружающей его среды он выбирает цели, задачи и ценности, проистекающие из обычаев и обусловленные состоянием общества. Ему характерны серьезность настойчивость, консерватизм, исполнительность. В соответствии с этим его подход к проблемам носит стереотипичный, практический и конкретный характер.",
  },
  {
    resultValue: "Предприимчивый",
    decryption:
      "Предприимчивый тип избирает цели, ценности и задачи, позволяющие ему проявить энергию, энтузиазм, импульсивность, доминантность, реализовать любовь к приключенчеству. Ему не по душе занятия, связанные с ручным трудом, а также требующие усидчивости, большой концентрации внимания и интеллектуальных усилий. Предпочитает руководящие роли в которых может удовлетворять свои потребности в доминантности и признании. Активен, предприимчив.",
  },
  {
    resultValue: "Артистический",
    decryption:
      "Артистичный тип отстраняется от отчетливо структурированных проблем и видов деятельности, предполагающих большую физическую силу. В общении с окружающими опираются на свои непосредственные ощущения, эмоции, интуицию и воображение. Ему присущ сложный взгляд на жизнь, гибкость, независимость суждений. Свойственна несоциальность, оригинальность.",
  },
];

export const thomasKennethDecryption = [
  {
    resultValue: "Соперничество",
    decryption: "Стремление добиться удовлетворения своих интересов в ущерб интересам другого. Человек, который следует этой стратегии, уверен, что выйти победителем из конфликта может только один участник и победа одного участника неизбежно означает поражение второго. Такой человек будет настаивать на своем, во чтобы то ни стало, а позицию другого человека не будет принимать во внимание. Упорное отстаивание своих интересов в ущерб интересов другого человека может помочь человеку временно удержать вверх в конфликтной ситуации. Однако к длительным отношениям (будь то дружеские отношения, отношения с любимым человеком, в семье, на работе и т.д.) такой подход не применим.",
  },
  {
    resultValue: "Сотрудничество",
    decryption: "При выборе этой стратегии участник стремиться разрешить конфликт таким образом, чтобы в выигрыше оказались все. Он не просто учитывает позицию другого участника, но и стремится добится, чтобы другая сторона тоже была бы удовлетворена. Стремление выслушать другого человека, понять его точку зрения, учесть его интересы и найти в спорной ситуации решение, устраивающее все стороны – необходимо в любых долгосрочных отношениях. Такой подход способствует развитию взаимного уважения, понимания, доверия, и, тем самым, делает отношения более прочными и стабильными.",
  },
  {
    resultValue: "Компромисс",
    decryption: "Частичное удовлетворение интересов обеих сторон конфликта. Хотя при компромиссе учитываются интересы всех конфликтующих сторон, и этот исход можно назвать справедливым, необходимо помнить, что в большинстве случаев – компромисс можно рассматривать только как промежуточный этап разрешения конфликта перед поиском такого решения, в котором обе стороны были бы удовлетворены полностью. При данной стратегии поведения, человек действует по принципу: «Я уступлю немного, если вы тоже готовы уступить». Взвешенность, сбалансированность и осторожность – основная установка этого типа поведения.",
  },
  {
    resultValue: "Избегание",
    decryption: "Стараются избежать обсуждения конфликтных вопросов и отложить принятие сложного решения «на потом». В этом случае человек не отстаивает собственные интересы, но при этом не учитывает и интересы других. Такая стратегия может быть полезна либо, когда предмет конфликта не очень важен, либо когда с другой стороной конфликта не обязательно поддерживать длительные отношения. Но в долгосрочных отношениях важно открыто обсуждать все спорные вопросы, а избегание существующих трудностей приводит только к накоплению неудовлетворенности и напряжения.",
  },
  {
    resultValue: "Приспособление",
    decryption: "Это такой способ поведения участника конфликта, при котором он готов поступиться своими интересами и уступить другому человеку ради того, чтобы избежать противостояния. Такую позицию могут занимать люди с низкой самооценкой, которые считают, что их цели и интересы не должны приниматься во внимание. Если предмет спора не так уж важен, а важнее сохранить хорошие взаимоотношения с другим человеком, то уступить, дать ему таким образом самоутвердиться может быть наиболее подходящим вариантом поведения. Но если конфликт касается важных вопросов, которые затрагивают чувства участников спора, то такую стратегию нельзя назвать продуктивной. Её результатом будет отрицательные эмоции уступившей стороны (злость, обида, разочарование и др.), а в долгосрочной перспективе потеря доверия, уважения и взаимопонимания между участниками.",
  },
];

export const MBTIDecryption=[
  {
    resultValue:'Логико-сенсорный экстраверт (ESTJ)',
    decryption:'Главное в жизни — это разумно направленный труд, организованный нужным образом. Работать должно быть удобно, и за труд необходимо получать заслуженное вознаграждение. ЛСЭ нацелен на практическую деятельность, умеет создавать высококачественную продукцию, предпочитает работать аккуратно и последовательно. Умеет использовать трудовые ресурсы людей как производственный фактор. Склонен к принципиальным подходам, которые позволяют уложить частности в глобальную систему. В общественной жизни также должны соблюдаться общепринятые правила. Лучше всего может реализовать себя в любой практической деятельности — производстве, строительстве, медицине (хирург); способен стать хорошим администратором любого уровня, юристом. Успешно справляется с военной службой, работой в органах правопорядка, силовых структурах, в спорте, в том числе и в профессиональном, хороший тренер.',
  },
  {
    resultValue:'Сенсорно-логический интроверт (ISTP)',
    decryption:'Все в мире должно быть гармоничным, пропорциональным, сбалансированным, и самый верный путь к достижению этого — делать эстетичную, качественную продукцию. Главное — ощущение гармонии, красоты, здоровья. Все должно быть сбалансировано, прекрасное должно сочетаться с целесообразным. СЛИ умеет отстаивать свою незримую «территорию», отличается упорством, иногда переходящим в упрямство, однако сам не склонен к экспансии. Хорошо умеет использовать подручный материал для получения практического результата. Любит качественную, скрупулезную и последовательную работу. Любая индивидуальная практическая деятельность. Мастер своего дела, любит работать самостоятельно или в небольшом коллективе, к руководящей работе не стремится. Может оказаться способным художником, дизайнером, музыкантом. Хорошее ощущение физического состояния — как своего, так и окружающих — может привести его в медицину, спорт, а также к профессиям, связанным с кулинарией.'
  },
  {
    resultValue:'Сенсорно-логический экстраверт (ESTP)',
    decryption:'Миром правит сила, и задача состоит в том, чтобы правильно рассчитать баланс сил и организовать их действие в нужном направлении: только так можно победить. Основные качества СЛЭ — волевой напор, неукротимая жажда деятельности, спортивный тонус и решительность. Главное для него — победа. Умеет создать комфорт, сделать удобным любой предмет в быту, но это произойдет, только если у него останутся силы после преодоления препятствий. Обладает хорошим вкусом при подборе одежды. СЛЭ прекрасный организатор любого масштаба в любой области — в науке, искусстве, медицине... Также легко реализует свои способности в любой силовой структуре, на военной службе, в разведке. Бойцовские качества его также оказываются уместными и в спорте.'
  },
  {
    resultValue:'Логико-сенсорный интроверт (ISTJ)',
    decryption:'Жизнь должна подчиняться определенной системе — как в материальном мире, так и в мире человеческих отношений, и следует прилагать известные усилия для поддержания и усовершенствования этой системы. ЛСИ — человек структуры, которую он стремится найти, в нее встроиться, ей следовать, ее совершенствовать путем создания правил, инструкций, нормативов. Очень любит что-то коллекционировать. Умеет работать «по крупному» , предпочитает сначала сделать главное, а мелочь может оставить и «на потом». Незаменим там, где требуется четкое и неукоснительное соблюдение правил, инструкций, технологических нормативов... Идеальный работник ОТК, конвейера, канцелярии, бухгалтерии, диспетчерской службы... Так же успешно ЛСИ реализует себя в математике, программировании, в издательском деле. Импонирует ему и служба в армии, где установлена четкая армейская структура подчинения.'
  },
  {
    resultValue:'Логико-интуитивный экстраверт (ENTJ)',
    decryption:'Разумно направленный труд — главное, без чего немыслима жизнь человека, и для получения хорошего результата следует действовать эффективно, с максимальной выгодой используя время. ЛИЭ — один из самых динамичных психотипов. Работает охотно с прекрасным осознанием каждого своего действия. Предпочитает «крупноблочную» работу. Умеет систематизировать, создать эффективно работающую систему, в которой будут учтены все детали. ЛИЭ эффективно занимается научно-исследовательской работой, изобретатель, рационализатор. Удачно реализует свои способности в качестве предпринимателя, менеджера, умеет сориентироваться в ситуации нестабильности. Хороший педагог и воспитатель, особенно мальчиков. Уместен и в силовых структурах — оперативной работе.'
  },
  {
    resultValue:'Интуитивно-логический интроверт (INTP)',
    decryption:'Мир бесконечен, текуч, многообразен, его состояние непрерывно меняется, и цель человека — найти свое место в непрерывном ряду событий, стать его звеном. Действовать имеет смысл только тогда, когда определен оптимальный момент приложения сил. ИЛИ воспринимает все процессы, происходящие в мире, в динамике. Способность двигаться по оси времени позволяет ему увидеть далекую перспективу. Скептик и критик. Умеет выбрать из множества вариантов наиболее стоящий, ориентирован на далекую перспективу. ИЛИ прекрасно реализует себя везде, где требуется стратегический прогноз, — в политике, сфере финансов, науке, военном деле. Успешно может руководить коллективом любого масштаба, особенно если рядом находится помощник сенсорного типа. Проявляет склонность также к гуманитарным областям — философии, искусству.'
  },
  {
    resultValue:'Интуитивно-логический экстраверт (ENTP)',
    decryption:'Мир полон загадок, таящих в себе необычайные возможности. Разгадке этих тайн и воплощению возможностей способно помочь создание принципиально новых логических концепций. ИЛЭ обладает неугасимым интересом ко всему новому, сулящему захватывающие перспективы и возможности, готов пользоваться любым источником информации. Умеет предвидеть наступление крупных событий, обладает даром предчувствия, богатой фантазией. Наиболее ярко проявляются способности ИЛЭ в научной работе, в фундаментальных исследованиях. Представителям этого психотипа, как никому иному, удается стать зачинателями новых направлений в науке на основании синтеза, казалось бы, далеких друг от друга областей знаний. Некоторые представители ИЛЭ могут также успешно работать в сфере бизнеса, коммерции, чаще — в производстве интеллектуальной продукции, например, в книгоиздании.'
  },
  {
    resultValue:'Логико-интуитивный интроверт (INTJ)',
    decryption:'В основе всего происходящего лежат определенные закономерности, которые необходимо открыть, для этого следует как можно глубже вникнуть в суть явлений и процессов. Мышление ЛИИ носит аналитический характер, он стремится к познанию общих закономерностей, в своем сознании выстраивает модель, которая основана на его опыте. Работает скрупулезно и дотошно, любит во всем точность и порядок, аккуратен в мелочах. ЛИИ обладает всеми данными для исследовательской аналитической работы. Способность разобраться в сложных вопросах, увидеть проблему в целом и четко изложить результат своих размышлений делает ЛИИ хорошим преподавателем и методистом. Среди ЛИИ также встречаются люди искусства, чаще всего — музыканты, предпочитающие серьезную музыку.'
  },
  {
    resultValue:'Этико-сенсорный экстраверт (ESFJ)',
    decryption:'Главное, что движет людьми во всех их поступках, — это эмоции, и задача состоит в том, чтобы прибавить людям в этой жизни радости и удобств, избегая всего неприятного. ЭСЭ считает, что хорошее настроение — мерило всех ценностей; его необходимо приумножать и создавать всеми силами. Необходимо следовать законам нравственности — они для того и существуют, чтобы в нужный момент дать человеку правильный ориентир; ЭСЭ легко общается на близкой дистанции, считает, что каждый человек достоин внимания и поддержки. Самое подходящее занятие для ЭСЭ — сфера услуг; объяснить, помочь, посоветовать, любезно отвечать на все, порой не очень корректные вопросы — вот неполный перечень достоинств ЭСЭ, — работника сервиса. В сфере бизнеса ему лучше удаются дела, связанные с налаживанием коммуникаций, оформлением продукции и рекламой. Встречаются среди представителей ЭСЭ и прекрасные актеры, хорошие учителя.'
  },
  {
    resultValue:'Сенсорно-этический интроверт (ISFP)',
    decryption:'Главное в жизни — гармония, комфорт, возможность испытать удовольствие; надо всем окружающим это показать и пригласить их к совместному наслаждению, радоваться самому и приносить радость другим. СЭИ считает, что главное в жизни — получать возможно больше удовольствий. Он умеет создать вокруг себя уют и комфорт, хорошо чувствует потребности собственного тела. Гурман и эстет. Силовые методы решения проблем отвергает, предпочитает уклониться и от давления на себя, умело уходит на безопасное расстояние. Самая подходящая деятельность для СЭИ — сфера услуг в самом широком смысле этого слова. Среди людей этого типа можно встретить и великолепных артистов, музыкантов, художников; также люди этого психотипа могут успешно заниматься медициной, преподавательской деятельностью. СЭИ могут хорошо реализовать свои возможности в области дизайна, моделирования одежды, в кулинарии.'
  },
  {
    resultValue:'Сенсорно-этический экстраверт (ESFP)',
    decryption:'Каждому свойственно стремление расширить свое влияние, желание власти и славы, и для достижения этой цели необходимо научиться управлять людьми, манипулируя их слабостями, чтобы никогда не оказаться побежденным. СЭЭ — человек напористый, он — сильная личность, которая неудержимо стремится к своей цели и старается во что бы то ни стало ее достичь. Хорошо оценивает волевые качества людей близкого окружения. Любит и умеет позаботиться о здоровье и самочувствии близких, эстетике жилища, хорошо готовит пищу и при этом исходит из общих принципов здоровой целесообразности. Для СЭЭ наиболее подходящими являются профессии, в которых необходимо общение с людьми на всех уровнях. Это и политическая деятельность, и служба в армии (непременно в как можно более высоком чине), это и юриспруденция, артистическая деятельность, преподавание, коммерция, работа секретаря. Хотелось бы предостеречь людей этого психотипа от выбора научной деятельности, особенно в области теоретических дисциплин.'
  },
  {
    resultValue:'Этико-сенсорный интроверт (ISFJ)',
    decryption:'Условие нормальной жизни — гармония человеческих отношений, соблюдение норм этики, морали и нравственности, бережное хранение традиций, и следует прилагать долевые усилия для сохранения и поддержания этой системы ценностей. ЭСИ — моралист, считает главным соблюдение законов нравственности, для него важны традиции и ритуалы, которые помогают пережить трудности. Человек очень эмоциональный, но эти эмоции таятся глубоко внутри. Если, как ему кажется, его доброту начинают чрезмерно эксплуатировать — может неожиданно взорваться и накричать. ЭСИ — прирожденный работник социальной сферы. Он прекрасно реализует свои способности в медицине, в любой хозяйственной деятельности. Он, как правило, любит животных, сельскохозяйственные работы, находит себе достойное место в армии — наставник и воспитатель молодежи, умеющий создать хорошие бытовые условия для своих подопечных. Здесь он не рвется в начальники, а, скорее, стремится обеспечить прочный тыл.'
  },
  {
    resultValue:'Этико-интуитивный экстраверт (ENFJ)',
    decryption:'Жизнь наполнена смыслом, если в ней присутствуют эмоциональный накал, драматизм переживании, и надо угадать ту идею, которая захватит воображение людей и правильным образом сформирует их чувства. Жизнь для ЭИЭ - это сфера эмоций, которой он искусно управляет, как дирижер оркестром. Без периодических всплесков драматических переживаний он чувствует себя не у дел. Стремится стать эталоном проявления эмоций, демонстрируя окружающим, как и в какой ситуации следует себя вести. Наиболее эффективно работает ЭИЭ в тех областях деятельности, где требуется увлечь аудиторию, — это и театральные подмостки, и работа педагога; возможность управлять эмоциями толп на площадях приводит этих людей также и в политику. Часто ЭИЭ обладает литературным даром, музыкальностью, любовью к живописи, танцам... — все виды такого рода деятельности удаются ему наилучшим образом. Успешно может он работать и психологом.'
  },
  {
    resultValue:'Интуитивно-этический интроверт (INFP)',
    decryption:'Главная ценность в мире — роскошные сады собственного воображения. С ними возможно проникнуть в прошлое и будущее, почувствовать окружающий мир в его целостности, уловить динамику происходящего и затем эмоционально вдохновить людей на необходимые действия. Мечтатель и романтик, ИЭИ легко отрывается от реальности, умеет предчувствовать события, уловить их динамику. Видит скрытые возможности людей, их глубинную сущность; способен сам предложить новые идеи в интересующей его области. Самое подходящее занятие для ИЭИ — любая гуманитарная деятельность. Это могут быть занятия музыкой, литературой, искусствоведение, экскурсионная и экскурсоведческая работа, работа в печатных органах, журналистика, ведение телевизионных и радиопередач, интервью и т. д. Иногда встречаются представители этого психотипа, успешно работающие в области математики. Однако надо помнить, что для ИЭИ противопоказана любая производственная и хозяйственная деятельность.'
  },
  {
    resultValue:'Интуитивно-этический экстраверт (ENFP)',
    decryption:'Самое интересное и захватывающее — это увидеть потенциальные возможности и перспективные направления развития как в человеческом обществе, так и в сфере производства, и организовать людей для реализации увиденных возможностей. Для ИЭЭ самое важное и интересное — найти, увидеть, понять новую возможность чего бы то ни было. Из множества вариантов он способен выбрать самый стоящий и перспективный. Любит помечтать, пофантазировать, однако может и довольно точно прогнозировать развитие событий. Благодаря умению перестраиваться, предвидеть новые возможности, ИЭЭ незаменим в предпринимательской деятельности, в организации нового дела, в рекламе, журналистике... словом, там, где на первом месте — азарт, любопытство ко всему новому, умение наладить контакты. Также могут представители этого типа работать в науке, с легкостью предлагая неожиданный взгляд на проблему, некоторые из них успешно работают психологами.'
  },
  {
    resultValue:'Этико-интуитивный интроверт (INFJ)',
    decryption:'Условие нормальной жизни — гармония человеческих отношений, соблюдение норм этики, морали и нравственности, бережное хранение традиций, поэтому необходимо заниматься нравственным усовершенствованием, воспитывать и развивать духовность, искать в человеке истинные ценности. Главное для ЭИИ — нравственные нормы поведения, он считает необходимым выслушать каждого, кто в этом нуждается, и помочь сочувствием и участием. Будучи очень эмоциональным, тем не менее считает, что не следует концентрироваться на плохом, а нужно искать в жизни положительные стороны. Лучшее применение способностей ЭИИ — область духовных знаний, просветительства, религии. Он может также быть и педагогом-наставником, особую тягу ЭИИ испытывает к психологии. Многие представители этого психотипа реализуют себя также в искусстве, если только это не связано с выступлением перед большой аудиторией; скорее — преподавание в области гуманитарных наук, искусства.'
  },
]
