export const klimovQuestionare = {
  test_name: "Опросник Климова",
  test_desc:
    "Методика предназначена для отбора на различные типы профессий в соответствии с классификацией типов профессий Е.А.Климова.",
  psychotype: false,
  test_content: [
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Ухаживать за животными",
        "Обслуживать машины, приборы (следить, регулировать)",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Помогать больным",
        "Составлять таблицы, схемы, программы для вычислительных машин",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Следить за качеством книжных иллюстраций, плакатов, художественных открыток, грампластинок",
        "Следить за состоянием, развитием растений",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Обрабатывать материалы (дерево, ткань, металл, пластмассу и т.п.)",
        "Доводить товары до потребителя, рекламировать, продавать",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Обсуждать научно-популярные книги, статьи",
        "Обсуждать художественные книги (или пьесы, концерты)",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Выращивать молодняк (животных какой-либо породы)",
        "Тренировать товарищей (или младших) в выполнении каких-либо действий (трудовых, учебных, спортивных)",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Копировать рисунки, изображения (или настраивать музыкальные инструменты)",
        "Управлять каким-либо грузовым (подъемным или транспортным) средством – подъемным краном, трактором, тепловозом и др.",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Сообщать, разъяснять людям нужные им сведения (в справочном бюро, на экскурсии и т.д.)",
        "Оформлять выставки, витрины (или участвовать в подготовке пьес, концертов)",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Ремонтировать вещи, изделия (одежду, технику), жилище",
        "Искать и исправлять ошибки в текстах, таблицах, рисунках",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: ["Лечить животных", "Выполнять вычисления, расчеты"],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Выводить новые сорта растений",
        "Конструировать, проектировать новые виды промышленных изделий (машины, одежду, дома, продукты питания и т.п.)",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Разбирать споры, ссоры между людьми, убеждать, разъяснять, наказывать, поощрять ",
        "Разбираться в чертежах, схемах, таблицах (проверять, уточнять, приводить в порядок)",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Наблюдать, изучать работу кружков художественной самодеятельности",
        "Наблюдать, изучать жизнь микробов",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Обслуживать, налаживать медицинские приборы, аппараты",
        "Оказывать людям медицинскую помощь при ранениях, ушибах, ожогах и т.п.",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Художественно описывать, изображать события (наблюдаемые и представляемые)",
        "Составлять точные описания-отчеты о наблюдаемых явлениях, событиях, измеряемых объектах и др.",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Делать лабораторные анализы в больнице",
        "Принимать, осматривать больных, беседовать с ними, назначать лечение",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Красить или расписывать стены помещений, поверхность изделий",
        "Осуществлять монтаж или сборку машин, приборов",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Организовать культпоходы сверстников или младших в театры, музеи, экскурсии, туристические походы и т.п.",
        "Играть на сцене, принимать участие в концертах",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Изготовлять по чертежам детали, изделия (машины, одежду), строить здания",
        "Заниматься черчением, копировать чертежи, карты",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Вести борьбу с болезнями растений, с вредителями леса, сада",
        "Работать на клавишных машинах (пишущей машинке, телетайпе, наборной машине и др.)",
      ],
    },
  ],
};

export const hollandTest = {
  test_name: "Тест Голланда",
  test_desc:
    "Тест предназначен для определения профессиональной направленности личности",
  psychotype: false,
  test_content: [
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["инженер-технолог", "инженер-конструктор"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["электрорадиотехник", "врач-терапевт"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: [
        "оператор станков с числовым программным управлением",
        "кодировщик (обработка информации)",
      ],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["фотограф", "коммерсант"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["спасатель МЧС", "дизайнер"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["политолог", "психиатр"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["ученый-химик", "бухгалтер"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["философ", "частный предприниматель"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["лингвист", "модельер"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["инспектор службы занятости населения", "статист"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["социальный педагог", "биржевой маклер"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["тренер", "искусствовед"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["нотариус", "менеджер"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["перфораторщик", "художник"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: [
        "лидер политической партии, общественного движения",
        "писатель",
      ],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["закройщик", "метеоролог"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["водитель", "работник пресс-службы"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["чертежник", "риэлтер"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: [
        "специалист по ремонту компьютеров и оргтехники",
        "секретарь-референт",
      ],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["микробиолог", "психолог"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["видеооператор", "режиссер"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["экономист", "провизор"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["зоолог", "главный инженер"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["программист", "архитектор"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: [
        "работник инспекции по делам несовершеннолетних",
        "коммивояжер (сетевой маркетинг)",
      ],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["преподаватель", "биржевой маклер"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["воспитатель", "декоратор"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["реставратор", "зав. отделом предприятия"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["корректор", "литератор и кинокритик"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["фермер", "визажист"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["парикмахер", "социолог"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["экспедитор", "редактор"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["ветеринар", "директор (финансовый)"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["автомеханик", "стилист"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["археолог", "эксперт"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["библиограф", "корреспондент"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["эколог", "актер"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["логопед", "контролер"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["адвокат", "директор (глава АО)"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["кассир", "продюсер"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["поэт, писатель", "продавец"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["криминалист", "композитор"],
    },
  ],
};

export const thomasKennethTest = {
  test_name: "Тест Томаса Кеннета",
  test_desc:
    "Тест предназначен для определения предпочтительных для Вас стилей разрешения конфликтных ситуаций",
  psychotype: true,
  test_content: [
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "В некоторых случаях я могу предоставить другому человеку возможность быть ответственным за решение неоднозначного вопроса",
        "Я стремлюсь обращать внимание на точки соприкосновения, а не на расхождения во взглядах",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Я всегда стремлюсь найти компромисс",
        "Я всегда стараюсь решить проблему так, чтобы были учтены и интересы и мои и другого",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Практически всегда я непреклонен в достижении своей цели",
        "Практически всегда я пытаюсь сохранить хорошие взаимоотношения",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Я всегда стремлюсь к компромиссу",
        "В некоторых случаях я могу поступиться своими интересами, чтобы в выигрыше остался другой человек",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "В процессе разрешения конфликта, я стремлюсь найти поддержку у соперника",
        "Я всегда стремлюсь сделать так, чтобы напряжённости не возникло",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Я всегда стремлюсь сделать так, чтобы у меня не было неприятностей",
        "Я всегда стремлюсь достичь своей цели",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Часто я стремлюсь отложить принятие решения по спорному вопросу, чтобы сделать это позже",
        "Нередко я могу пойти на уступки, чтобы добиться другой цели",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Как правило, я всегда настаиваю на своём",
        "В первую очередь, я всегда хочу понять, в чём суть всех затрагиваемых вопросов и интересов",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Мне кажется, что переживать по поводу разногласий следует далеко не всегда",
        "Я делаю всё, чтобы было так, как хочу я",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Я решительно пытаюсь достичь своей цели",
        "Чаще всего я стремлюсь к поиску компромиссного решения",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "В первую очередь, я всегда хочу понять, в чём суть всех затрагиваемых вопросов и интересов",
        "Практически всегда я пытаюсь сохранить хорошие взаимоотношения",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Чаще всего, я стараюсь избежать позиции, способной вызвать разногласия",
        "Я могу легко пойти другому навстречу, если и он тоже готов пойти на уступки",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Чаще я предлагаю найти среднее решение",
        "Чаще я продолжаю настаивать на своём",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Я всегда объясняю другому свою позицию и интересуюсь, как думает он",
        "Я всегда доказываю другому логичность своих суждений и плюсы своей позиции",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Практически всегда я пытаюсь сохранить хорошие взаимоотношения",
        "Я всегда стремлюсь сделать так, чтобы напряжённости не возникло",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Я всегда учитываю чувства другого и стараюсь не задеть их",
        "Я всегда доказываю другому логичность своих суждений и плюсы своей позиции",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Как правило, я настойчив в достижении своей цели",
        "Я всегда стремлюсь сделать так, чтобы напряжённости не возникло",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Я могу позволить человеку настаивать на своём, если знаю, что он будет счастлив",
        "Я могу легко пойти другому навстречу, если и он тоже готов пойти на уступки",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "В первую очередь, я всегда хочу понять, в чём суть всех затрагиваемых вопросов и интересов",
        "Часто я стремлюсь отложить принятие решения по спорному вопросу, чтобы сделать это позже",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Я всегда стремлюсь к немедленному преодолению разногласий",
        "Я всегда настроен на лучшее сочетание потерь и выгод для каждого",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "В процессе переговоров я всегда учитываю желания другой стороны",
        "Мне больше нравится, когда проблема обсуждается прямо",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Я стремлюсь занять такую позицию, которая будет посредине между моей личной и противоположной",
        "Я всегда стремлюсь отстоять свои желания",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Меня всегда волнует вопрос, удовлетворены ли желания другой стороны",
        "В некоторых случаях я могу предоставить другому человеку возможность быть ответственным за решение неоднозначного вопроса",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Если для другого человека очень важна его позиция, я пойду ему навстречу",
        "Я стремлюсь склонить другого к компромиссному решению",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Я всегда доказываю другому логичность своих суждений и плюсы своей позиции",
        "В процессе переговоров я всегда учитываю желания другой стороны",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Чаще я предлагаю найти среднее решение",
        "Практически всегда я стремлюсь сделать так, чтобы были удовлетворены желания всех сторон",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Я стараюсь не занимать потенциально спорной позиции",
        "Я могу позволить человеку настаивать на своём, если знаю, что он будет счастлив",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Как правило, я настойчив в достижении своей цели",
        "В процессе разрешения конфликта, я стремлюсь найти поддержку у соперника",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Чаще я предлагаю найти среднее решение",
        "Мне кажется, что переживать по поводу разногласий следует далеко не всегда",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Я всегда стараюсь сделать так, чтобы чувства другого не были задеты",
        "Чаще всего я придерживаюсь такой позиции в спорной ситуации, чтобы и я и другой человек достигли успеха",
      ],
    },
  ],
};

export const MBTITest = {
  test_name: "Тест на тип личности по MBTI",
  test_desc:
    "Тест фокусируется на выявлении общих черт личности, предпочтениях и способах взаимодействия с миром",
  psychotype: true,
  test_content: [
    {
      question: "Когда Вы находитесь в обществе, Вы обычно предпочитаете:",
      answers: ["участвовать в общей беседе", "беседовать с каждым отдельно"],
    },
    {
      question: "Вы в большей степени человек:",
      answers: ["реалистичный", "склонный к теоретизированию"],
    },
    {
      question: "По Вашему мнению, хуже:",
      answers: ["«витать в облаках»", "«катиться по накатанной колее»"],
    },
    {
      question: "На Вас большее впечатление производят:",
      answers: ["принципы", "эмоции"],
    },
    {
      question: "Вас больше привлекает:",
      answers: ["убедительное", "трогательное"],
    },
    {
      question: "Если Вам приходится выполнять необычную работу, Вам лучше:",
      answers: [
        "спланировать ее заранее",
        "выяснить, что надо делать, в ходе работы",
      ],
    },
    {
      question: "Вы склонны делать выбор:",
      answers: ["осторожно", "импульсивно"],
    },
    {
      question: "На вечеринках Вы:",
      answers: [
        "задерживаетесь допоздна, все более оживляетесь",
        "уходите рано, чувствуя усталость",
      ],
    },
    {
      question: "Вас больше привлекают:",
      answers: ["реалисты", "люди с богатым воображением"],
    },
    {
      question: "Вы больше интересуетесь:",
      answers: ["реально существующим", "возможным"],
    },
    {
      question: "Ваши суждения о людях основаны:",
      answers: [
        "на правилах чаще, чем на обстоятельствах",
        "на обстоятельствах чаще, чем на правилах",
      ],
    },
    {
      question: "В отношении других людей Вы обычно:",
      answers: ["объективны", "субъективны"],
    },
    {
      question: "Вы чаще действуете:",
      answers: ["пунктуально", "неторопливо и неспешно"],
    },
    {
      question: "Вы предпочитаете:",
      answers: [
        "выполнять работу заблаговременно",
        "откладывать все на последний момент",
      ],
    },
    {
      question: "Среди Ваших друзей Вы:",
      answers: [
        "полны новостей обо всех",
        "последним узнаете о том, что происходит",
      ],
    },
    {
      question: "Выполняя обычную работу, вам приятнее:",
      answers: [
        "делать ее общепринятым способом",
        "изобрести собственный способ",
      ],
    },
    {
      question:
        "Когда Вы читаете в свое удовольствие, Вам нравится, когда писатель:",
      answers: [
        "четко говорит, что он имеет в виду",
        "излагает мысли в необычной, оригинальной форме",
      ],
    },
    {
      question: "Вас больше привлекает:",
      answers: [
        "последовательность и логичность рассуждений",
        "гармоничность человеческих отношений",
      ],
    },
    {
      question: "Вам легче выносить суждения:",
      answers: ["основанные на логике", "основанные на ценностях"],
    },
    {
      question: "Вас больше привлекают ситуации:",
      answers: ["определенные и завершенные", "неопределенные и незавершенные"],
    },
    {
      question: "Вы можете сказать, что Вы в большей степени:",
      answers: [
        "серьезный и волевой человек",
        "легко относящийся к жизни человек",
      ],
    },
    {
      question: "Говоря по телефону, Вы:",
      answers: [
        "редко задаетесь вопросом, все ли будет сказано",
        "заранее продумываете, что будете говорить",
      ],
    },
    {
      question: "Факты:",
      answers: [
        "«говорят сами за себя»",
        "иллюстрируют некоторые закономерности",
      ],
    },
    {
      question: "Мечтатели и фантазеры:",
      answers: ["раздражают Вас", "пленяют и очаровывают"],
    },
    {
      question: "Чаще Вы человек",
      answers: ["хладнокровный и спокойный", "сердечный и участливый"],
    },
    {
      question: "Вы считаете, что хуже быть",
      answers: ["неразумным", "недоброжелательным"],
    },
    {
      question: "В большинстве случаев следует:",
      answers: [
        "управлять ходом событий",
        "полагаться на естественный ход событий",
      ],
    },
    {
      question: "Вы чувствуете себя лучше, когда",
      answers: ["уже сделали покупку", "имеете возможность сделать покупку"],
    },
    {
      question: "В компании Вы:",
      answers: [
        "являетесь инициатором разговора",
        "ждете, когда к Вам обратятся",
      ],
    },
    {
      question: "Утверждения, сделанные на основе здравого смысла:",
      answers: ["редко вызывают сомнения", "часто вызывают сомнения"],
    },
    {
      question: "Вы бы хотели, чтобы Вашим другом был человек:",
      answers: [
        "который твердо стоит на земле",
        "у которого всегда появляются новые идеи",
      ],
    },
    {
      question: "Принимая решения, Вам легче иметь дело с:",
      answers: ["правилами и стандартами", "чувствами"],
    },
    {
      question: "Вы скорее человек:",
      answers: ["твердый, чем мягкий", "мягкий, чем твердый"],
    },
    {
      question: "Вас более привлекает способность:",
      answers: [
        "целенаправленно организовывать",
        "использовать имеющиеся возможности",
      ],
    },
    {
      question: "Вы больше цените в ситуации:",
      answers: ["ясность", "неизвестность"],
    },
    {
      question: "Новое и необычное взаимодействие с людьми:",
      answers: [
        "стимулирует Вас и наполняет энергией",
        "утомляет Вас и расходует энергию",
      ],
    },
    {
      question: "В большинстве случаев Вы человек:",
      answers: ["практичный", "с фантазией и прихотями"],
    },
    {
      question: "Вы в большей степени склонны стараться узнать:",
      answers: [
        "чем другие люди могут быть полезны",
        "точку зрения других людей",
      ],
    },
    {
      question: "Вам приносит большее удовлетворение:",
      answers: [
        "тщательное обсуждение вопроса",
        "достижение согласия об обсуждаемом",
      ],
    },
    {
      question: "Вашими действиями в большей степени руководит:",
      answers: ["Ваша голова", "Ваше сердце"],
    },
    {
      question:
        "Когда Вы знаете, что в определенное время будете заниматься определенным делом:",
      answers: [
        "Вы рады, что можете спланировать свое время",
        "Вам неприятно, что Вы чем-то связаны",
      ],
    },
    {
      question: "Обычно Вы:",
      answers: [
        "стремитесь достичь заданных результатов",
        "бываете довольны тем, что получается",
      ],
    },
    {
      question: "Вы предпочитаете:",
      answers: [
        "много друзей и непродолжительные отношения",
        "несколько друзей и продолжительные отношения",
      ],
    },
    {
      question: "Вы руководствуетесь в большей степени:",
      answers: ["фактами", "закономерностями"],
    },
    {
      question: "Вас больше интересует:",
      answers: [
        "производство и распространение продукции",
        "исследования и конструирование",
      ],
    },
    {
      question: "Вы считаете комплиментом, если Вас называют:",
      answers: ["логично мыслящим человеком", "чувствительным человеком"],
    },
    {
      question: "В себе Вы больше цените:",
      answers: ["решительность", "преданность"],
    },
    {
      question: "Вы предпочитаете утверждения:",
      answers: ["окончательные", "пробные и предварительные"],
    },
    {
      question: "Вы лучше себя чувствуете:",
      answers: ["после принятия решения", "до принятия решения"],
    },
    {
      question: "Общаясь с малознакомыми людьми, Вы:",
      answers: [
        "легко ведете продолжительные беседы",
        "с трудом находите темы для разговора",
      ],
    },

    {
      question: "Вы больше доверяете:",
      answers: ["своему опыту", "своей интуиции"],
    },
    {
      question: "Вы бы предпочли, чтобы Вас считали:",
      answers: ["практичным человеком", "изобретательным человеком"],
    },
    {
      question: "Более достоин похвалы человек:",
      answers: ["обладающий ясным умом", "способный на сильные чувства"],
    },
    {
      question: "Вы более склонны быть:",
      answers: [
        "справедливым и беспристрастным",
        "сочувствующим и сопереживающим",
      ],
    },
    {
      question: "Если Вы действуете по плану, это:",
      answers: ["нравится Вам", "стесняет и ограничивает Вас"],
    },
    {
      question: "Вам лучше удается:",
      answers: [
        "следовать четко продуманному плану",
        "справляться с неожиданностями",
      ],
    },
    {
      question: "Вы считаете, что близкие к Вам люди знают Ваше мнение:",
      answers: [
        "по поводу большинства вещей",
        "только если Вы сообщите его им",
      ],
    },
    {
      question: "В себе Вы больше цените:",
      answers: ["сильное чувство реальности", "живое воображение"],
    },
    {
      question: "Если бы Вы были учителем, то предпочли бы преподавать:",
      answers: ["практические предметы", "теоретические предметы"],
    },
    {
      question: "Вы считаете большей ошибкой быть:",
      answers: ["слишком вспыльчивым", "слишком объективным"],
    },
    {
      question: "Вы считаете себя:",
      answers: ["трезво мыслящим", "милосердным и отзывчивым"],
    },
    {
      question: "Вас больше привлекают ситуации:",
      answers: [
        "упорядоченные и распланированные",
        "неупорядоченные и нераспланированные",
      ],
    },
    {
      question: "Вы поступаете:",
      answers: [
        "в соответствии с правилами чаще, чем эксцентрично",
        "эксцентрично чаще, чем в соответствии с правилами",
      ],
    },
    {
      question: "Обычно Вы:",
      answers: ["общительный человек", "спокойный и сдержанный человек"],
    },
    {
      question: "Когда Вы пишете, то предпочитаете:",
      answers: ["выражаться буквально", "выражаться образно"],
    },
    {
      question: "Вам труднее:",
      answers: [
        "чувствовать солидарность с окружающими",
        "извлекать пользу из окружающих",
      ],
    },
    {
      question: "Вы пожелали бы себе:",
      answers: ["большей ясности ума", "большей способности к состраданию"],
    },
    {
      question: "Вы бы предпочли работать с руководителем:",
      answers: ["который всегда справедлив", "всегда доброжелателен"],
    },
    {
      question: "Вы предпочитаете:",
      answers: ["запланированные события", "незапланированные события"],
    },
    {
      question: "Вы более склонны:",
      answers: ["к продуманному поведению", "к продуманному поведению"],
    },
  ],
};

export const HoneyMumfordTest = {
  test_name: "Тест Хани-Мамфорда",
  test_desc: "Тест определяет предпочтительные, эффективные для Вас стили обучения",
  psychotype: true,
  test_content: [
    {
      question: "Я имею четкие убеждения относительно того, что является правильным, а что неправильным,  что хорошо, а что плохо.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я часто действую без учета возможных последствий.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я имею склонность решать задачи, продвигаясь шаг за шагом.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я полагаю, что формальные процедуры ограничивают людей.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я имею репутацию человека, который говорит то, что думает, просто и прямо.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я часто нахожу, что действия, основанные на чувствах, являются такими же разумными, как и  действия, основанные на тщательном обдумывании и анализе.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Мне нравится такой вид работы, при котором я имею время для тщательной подготовки и  выполнения.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я часто спрашиваю людей об их основных убеждениях.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Наиболее существенным является вопрос, работает ли это на практике.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я активно стремлюсь к приобретению нового опыта.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Когда я слышу о какой-то новой идее или подходе, я немедленно начинаю работать над их  применением на практике.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я приверженец самодисциплины, такой как соблюдение диеты, выполнение регулярных  физических упражнений, поддержание определенного режима дня.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я горжусь тем, что делаю работу тщательно.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Лучше всего мне работается с логично и аналитически мыслящими людьми и менее хорошо с  людьми, ведущими себя спонтанно и нерационально.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я забочусь о корректности интерпретации доступных мне данных и избегаю поспешных  выводов.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Мне нравится принимать решения осторожно, после взвешивания альтернативных вариантов.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Новые, необычные идеи меня привлекают в большей степени, чем проверенные на практике.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Мне не нравится неупорядоченность чего-либо, я предпочитаю систематизировать по  некоторой модели.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я придерживаюсь установленных процедур до тех пор, пока считаю их эффективными для  выполнения работы.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Мне нравится соотносить мои действия с некоторыми общими принципами.",
      answers: ["Да", "Нет"],
    },
    {
      question: "В дискуссиях мне нравится добираться до сути.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я склонен общаться, соблюдая дистанцию, и поддерживать несколько формальные отношения  с людьми на работе.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Мне удается успешно справляться с новыми и разнообразными задачами.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Мне нравятся люди, ведущие себя спонтанно и любящие шутки.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я уделяю пристальное внимание деталям, прежде чем прийти к какому-либо заключению.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Мне трудно генерировать идеи под влиянием момента.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я верю в возможность немедленного постижения сути вопроса.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я осторожен и не делаю слишком поспешных выводов.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я предпочитаю иметь как можно больше источников информации: чем больше данных, тем  лучшая возможность предоставляется для обдумывания, есть из чего выбрать.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Легкомысленные люди, которые ко всему относятся недостаточно серьезно, обычно  раздражают меня.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я выслушиваю точку зрения других людей, прежде чем самому что-то предпринять.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я склонен открыто выражать свои чувства.",
      answers: ["Да", "Нет"],
    },
    {
      question: "В дискуссиях мне нравится наблюдать за поведением других участников.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я предпочитаю реагировать на события спонтанно и гибко, а не планировать ответ заранее.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я склонен увлекаться техническими приемами, такими как системный анализ, блок-схемы и  алгоритмы, ветвящиеся программы, ситуационное планирование и т. д.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Меня беспокоит, если я должен напряженно работать, чтобы уложиться в сжатые сроки.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я склонен оценивать идеи по их практическому воплощению.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Спокойные и вдумчивые люди заставляют меня чувствовать себя неловко.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Меня раздражают люди, которые действуют слишком поспешно.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Важнее пользоваться настоящим моментом, чем думать о прошлом или будущем.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я думаю, что решения, основанные на вдумчивом анализе всей информации, являются более  разумными, чем основанные на интуиции.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я склонен быть требовательным к себе и другим и добиваться совершенства во всем, особенно  в работе.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Во время обсуждений я обычно предлагаю множество неожиданных, стихийных идей.",
      answers: ["Да", "Нет"],
    },
    {
      question: "На совещаниях я выдвигаю практичные и реалистические идеи.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Часто правила существуют для того, чтобы они нарушались.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я предпочитаю отдалиться от ситуации и рассмотреть все перспективы.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я умею видеть несообразности и слабости в аргументах, приводимых другими людьми.",
      answers: ["Да", "Нет"],
    },
    {
      question: "В целом я больше говорю, чем слушаю.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Часто я вижу лучшие, более практичные способы выполнения чего-либо.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я думаю, что многие письменные доклады следует сократить, оставив самую суть.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я полагаю, что рациональное, логическое мышление сегодня должно занять ведущее  положение.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я более склонен к обсуждению с людьми конкретных вопросов, чем к участию в светских  разговорах.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Мне нравятся люди, которые охотнее подходят к проблемам с реалистической, а не с  теоретической точки зрения.",
      answers: ["Да", "Нет"],
    },
    {
      question: "В ходе обсуждений меня раздражают отклонения от темы и вопросы, не относящиеся к делу.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Если мне нужно написать доклад, я склонен проработать множество вариантов перед тем, как  остановиться на окончательной версии.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я стараюсь проверять идеи, чтобы убедиться, что они работают на практике.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я стремлюсь найти ответ посредством логического подхода.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Мне нравится много говорить.",
      answers: ["Да", "Нет"],
    },
    {
      question: "При обсуждении я часто нахожу, что я реалист, придерживающийся сути дела и избегающий  длинных рассуждений.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Мне нравится тщательно обдумывать альтернативные варианты, прежде чем составить свое  мнение.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Во время дискуссий я часто нахожу, что я беспристрастен и объективен.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Во время дискуссий я занимаю сдержанную позицию, а не позицию лидера, и я не склонен  много говорить.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Мне нравится, что я могу соотносить текущие действия с более долгосрочной и более  глобальной перспективой.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Когда что-то идет не так, я стремлюсь быстрее закончить с этим и учесть в своем опыте.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я склонен отвергать сумасбродные, неожиданные идеи как непрактичные.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Лучше все тщательно обдумать, прежде чем действовать.",
      answers: ["Да", "Нет"],
    },
    {
      question: "В целом я охотнее слушаю, чем говорю.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я склонен быть жестким с теми людьми, которые не принимают логический подход.",
      answers: ["Да", "Нет"],
    },
    {
      question: "В большинстве случаев я верю, что цель оправдывает средства.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я не придаю значения тому, задеты ли чувства людей, пока работа не закончена.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я нахожу стесняющим обстоятельством наличие конкретных целей и планов.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Обычно я бываю одним из тех людей, кто превращает жизнь в вечеринку.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я делаю все, что является целесообразным, чтобы работа была выполнена.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Мне быстро надоедает методичная и длительная работа.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я строг при анализе основных предложений, принципов и теорий, связывающих факты и  события.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Мне всегда интересно знать, что думают люди.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я предпочитаю, чтобы совещания проводились методично, основываясь на принятой повестке  дня.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я избегаю субъективных и однозначных тем.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Я получаю удовольствие от драмы и волнений, кризисной ситуации.",
      answers: ["Да", "Нет"],
    },
    {
      question: "Люди часто считают, что я не чувствителен к переживаниям.",
      answers: ["Да", "Нет"],
    },
  ],
};
