export const klimovQuestionare = {
  test_name: "Опросник Климова",
  test_desc:
    "Методика предназначена для отбора на различные типы профессий в соответствии с классификацией типов профессий Е.А.Климова.",
  psychotype: false,
  test_content: [
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Ухаживать за животными",
        "Обслуживать машины, приборы (следить, регулировать)",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Помогать больным",
        "Составлять таблицы, схемы, программы для вычислительных машин",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Следить за качеством книжных иллюстраций, плакатов, художественных открыток, грампластинок",
        "Следить за состоянием, развитием растений",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Обрабатывать материалы (дерево, ткань, металл, пластмассу и т.п.)",
        "Доводить товары до потребителя, рекламировать, продавать",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Обсуждать научно-популярные книги, статьи",
        "Обсуждать художественные книги (или пьесы, концерты)",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Выращивать молодняк (животных какой-либо породы)",
        "Тренировать товарищей (или младших) в выполнении каких-либо действий (трудовых, учебных, спортивных)",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Копировать рисунки, изображения (или настраивать музыкальные инструменты)",
        "Управлять каким-либо грузовым (подъемным или транспортным) средством – подъемным краном, трактором, тепловозом и др.",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Сообщать, разъяснять людям нужные им сведения (в справочном бюро, на экскурсии и т.д.)",
        "Оформлять выставки, витрины (или участвовать в подготовке пьес, концертов)",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Ремонтировать вещи, изделия (одежду, технику), жилище",
        "Искать и исправлять ошибки в текстах, таблицах, рисунках",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: ["Лечить животных", "Выполнять вычисления, расчеты"],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Выводить новые сорта растений",
        "Конструировать, проектировать новые виды промышленных изделий (машины, одежду, дома, продукты питания и т.п.)",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Разбирать споры, ссоры между людьми, убеждать, разъяснять, наказывать, поощрять ",
        "Разбираться в чертежах, схемах, таблицах (проверять, уточнять, приводить в порядок)",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Наблюдать, изучать работу кружков художественной самодеятельности",
        "Наблюдать, изучать жизнь микробов",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Обслуживать, налаживать медицинские приборы, аппараты",
        "Оказывать людям медицинскую помощь при ранениях, ушибах, ожогах и т.п.",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Художественно описывать, изображать события (наблюдаемые и представляемые)",
        "Составлять точные описания-отчеты о наблюдаемых явлениях, событиях, измеряемых объектах и др.",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Делать лабораторные анализы в больнице",
        "Принимать, осматривать больных, беседовать с ними, назначать лечение",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Красить или расписывать стены помещений, поверхность изделий",
        "Осуществлять монтаж или сборку машин, приборов",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Организовать культпоходы сверстников или младших в театры, музеи, экскурсии, туристические походы и т.п.",
        "Играть на сцене, принимать участие в концертах",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Изготовлять по чертежам детали, изделия (машины, одежду), строить здания",
        "Заниматься черчением, копировать чертежи, карты",
      ],
    },
    {
      question: "Выберите предпочтительный вариант деятельности",
      answers: [
        "Вести борьбу с болезнями растений, с вредителями леса, сада",
        "Работать на клавишных машинах (пишущей машинке, телетайпе, наборной машине и др.)",
      ],
    },
  ],
};

export const hollandTest = {
  test_name: "Тест Голланда",
  test_desc:
    "Тест предназначен для определения профессиональной направленности личности",
  psychotype: false,
  test_content: [
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["инженер-технолог", "инженер-конструктор"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["электрорадиотехник", "врач-терапевт"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: [
        "оператор станков с числовым программным управлением",
        "кодировщик (обработка информации)",
      ],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["фотограф", "коммерсант"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["спасатель МЧС", "дизайнер"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["политолог", "психиатр"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["ученый-химик", "бухгалтер"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["философ", "частный предприниматель"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["лингвист", "модельер"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["инспектор службы занятости населения", "статист"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["социальный педагог", "биржевой маклер"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["тренер", "искусствовед"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["нотариус", "менеджер"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["перфораторщик", "художник"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: [
        "лидер политической партии, общественного движения",
        "писатель",
      ],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["закройщик", "метеоролог"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["водитель", "работник пресс-службы"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["чертежник", "риэлтер"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: [
        "специалист по ремонту компьютеров и оргтехники",
        "секретарь-референт",
      ],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["микробиолог", "психолог"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["видеооператор", "режиссер"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["экономист", "провизор"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["зоолог", "главный инженер"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["программист", "архитектор"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: [
        "работник инспекции по делам несовершеннолетних",
        "коммивояжер (сетевой маркетинг)",
      ],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["преподаватель", "биржевой маклер"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["воспитатель", "декоратор"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["реставратор", "зав. отделом предприятия"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["корректор", "литератор и кинокритик"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["фермер", "визажист"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["парикмахер", "социолог"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["экспедитор", "редактор"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["ветеринар", "директор (финансовый)"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["автомеханик", "стилист"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["археолог", "эксперт"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["библиограф", "корреспондент"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["эколог", "актер"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["логопед", "контролер"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["адвокат", "директор (глава АО)"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["кассир", "продюсер"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["поэт, писатель", "продавец"],
    },
    {
      question: "Выберите наиболее предпочтительную для Вас профессию",
      answers: ["криминалист", "композитор"],
    },
  ],
};

export const thomasKennethTest = {
  test_name: "Тест Томаса Кеннета",
  test_desc:
    "Тест предназначен для определения предпочтительных для Вас стилей разрешения конфликтных ситуаций",
  psychotype: false,
  test_content: [
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "В некоторых случаях я могу предоставить другому человеку возможность быть ответственным за решение неоднозначного вопроса",
        "Я стремлюсь обращать внимание на точки соприкосновения, а не на расхождения во взглядах",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Я всегда стремлюсь найти компромисс",
        "Я всегда стараюсь решить проблему так, чтобы были учтены и интересы и мои и другого",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Практически всегда я непреклонен в достижении своей цели",
        "Практически всегда я пытаюсь сохранить хорошие взаимоотношения",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Я всегда стремлюсь к компромиссу",
        "В некоторых случаях я могу поступиться своими интересами, чтобы в выигрыше остался другой человек",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "В процессе разрешения конфликта, я стремлюсь найти поддержку у соперника",
        "Я всегда стремлюсь сделать так, чтобы напряжённости не возникло",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Я всегда стремлюсь сделать так, чтобы у меня не было неприятностей",
        "Я всегда стремлюсь достичь своей цели",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Часто я стремлюсь отложить принятие решения по спорному вопросу, чтобы сделать это позже",
        "Нередко я могу пойти на уступки, чтобы добиться другой цели",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Как правило, я всегда настаиваю на своём",
        "В первую очередь, я всегда хочу понять, в чём суть всех затрагиваемых вопросов и интересов",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Мне кажется, что переживать по поводу разногласий следует далеко не всегда",
        "Я делаю всё, чтобы было так, как хочу я",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Я решительно пытаюсь достичь своей цели",
        "Чаще всего я стремлюсь к поиску компромиссного решения",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "В первую очередь, я всегда хочу понять, в чём суть всех затрагиваемых вопросов и интересов",
        "Практически всегда я пытаюсь сохранить хорошие взаимоотношения",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Чаще всего, я стараюсь избежать позиции, способной вызвать разногласия",
        "Я могу легко пойти другому навстречу, если и он тоже готов пойти на уступки",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Чаще я предлагаю найти среднее решение",
        "Чаще я продолжаю настаивать на своём",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Я всегда объясняю другому свою позицию и интересуюсь, как думает он",
        "Я всегда доказываю другому логичность своих суждений и плюсы своей позиции",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Практически всегда я пытаюсь сохранить хорошие взаимоотношения",
        "Я всегда стремлюсь сделать так, чтобы напряжённости не возникло",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Я всегда учитываю чувства другого и стараюсь не задеть их",
        "Я всегда доказываю другому логичность своих суждений и плюсы своей позиции",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Как правило, я настойчив в достижении своей цели",
        "Я всегда стремлюсь сделать так, чтобы напряжённости не возникло",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Я могу позволить человеку настаивать на своём, если знаю, что он будет счастлив",
        "Я могу легко пойти другому навстречу, если и он тоже готов пойти на уступки",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "В первую очередь, я всегда хочу понять, в чём суть всех затрагиваемых вопросов и интересов",
        "Часто я стремлюсь отложить принятие решения по спорному вопросу, чтобы сделать это позже",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Я всегда стремлюсь к немедленному преодолению разногласий",
        "Я всегда настроен на лучшее сочетание потерь и выгод для каждого",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "В процессе переговоров я всегда учитываю желания другой стороны",
        "Мне больше нравится, когда проблема обсуждается прямо",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Я стремлюсь занять такую позицию, которая будет посредине между моей личной и противоположной",
        "Я всегда стремлюсь отстоять свои желания",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Меня всегда волнует вопрос, удовлетворены ли желания другой стороны",
        "В некоторых случаях я могу предоставить другому человеку возможность быть ответственным за решение неоднозначного вопроса",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Если для другого человека очень важна его позиция, я пойду ему навстречу",
        "Я стремлюсь склонить другого к компромиссному решению",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Я всегда доказываю другому логичность своих суждений и плюсы своей позиции",
        "В процессе переговоров я всегда учитываю желания другой стороны",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Чаще я предлагаю найти среднее решение",
        "Практически всегда я стремлюсь сделать так, чтобы были удовлетворены желания всех сторон",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Я стараюсь не занимать потенциально спорной позиции",
        "Я могу позволить человеку настаивать на своём, если знаю, что он будет счастлив",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Как правило, я настойчив в достижении своей цели",
        "В процессе разрешения конфликта, я стремлюсь найти поддержку у соперника",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Чаще я предлагаю найти среднее решение",
        "Мне кажется, что переживать по поводу разногласий следует далеко не всегда",
      ],
    },
    {
      question: "Выберите характеризующее Вас поведение",
      answers: [
        "Я всегда стараюсь сделать так, чтобы чувства другого не были задеты",
        "Чаще всего я придерживаюсь такой позиции в спорной ситуации, чтобы и я и другой человек достигли успеха",
      ],
    },
  ],
};
